insert into worker values
(1, 'Бикметова', 'Диана', 'Рамилевна', 'bdr', '1234'),
(2, 'Бородашкина', 'Екатерина', 'Алексеевна', 'bea', '1234'),
(3, 'Калинин', 'Максим', 'Сергеевич', 'kms', '1234'),
(4, 'Иванов', 'Иван', 'Иванович', 'iii', '1234'),
(5, 'Поттер', 'Гарри', 'Джеймс', 'phj', '1234'),
(6, 'Гроттер', 'Татьяна', 'Леопольдовна', 'gtl', '1234'),
(7, 'Склепова', 'Гробыня', 'Викторовна', 'sgv', '1234');



insert into event values
(1, 'event1', '30.10.2022', '22:30', 'zoom'),
(2, 'event2', '29.10.2022', '18:20', 'hybrid'),
(3, 'event3', '2.11.2022', '10:00', 'office'),
(4, 'event4', '4.11.2022', '12:00', 'zoom');

	


insert into schedule values 
(1, 1),
(1,2),
(1,4),
(2,2),
(2,6),
(4,1),
(4,5);




