


insert into worker values
(1, '1031011893', 'Бикметова', 'Диана', 'Рамилевна', 'bdr', '1234'),
(2, '529326619', 'Бородашкина', 'Екатерина', 'Алексеевна', 'bea', '1234'),
(3, '336828785','Калинин', 'Максим', 'Сергеевич','kms', '1234'),
(4, NULL,'Иванов', 'Иван', 'Иванович', 'iii', '1234'),
(5, NULL, 'Поттер', 'Гарри', 'Джеймс', 'phj', '1234'),
(6, NULL, 'Гроттер', 'Татьяна', 'Леопольдовна', 'gtl', '1234'),
(7, NULL, 'Склепова', 'Гробыня', 'Викторовна', 'sgv', '1234'),
(8, NULL, 'fam1', 'name1', 'otch1', '111', '1234'),
(9, NULL, 'fam2', 'name2', 'otch2', '222', '1234'),
(10, NULL, 'fam3', 'name3', 'otch3', '333', '1234'),
(11, NULL, 'fam4', 'name4', 'otch4', '444', '1234'),
(12, NULL, 'Калинин', 'Сергей', 'Генадьевич', 'ksg', '1234'),
(13, NULL, 'Калинина', 'Елена', 'Владимировна','kev', '1234');



insert into event values
(1, 'event1', '2022-10-30', '10:30', 90,  'zoom'),
(2, 'event2', '2022-10-31', '15:00', 30, 'hybrid'),
(3, 'event3', '2022-11-02', '10:00', 240, 'office'),
(4, 'event4', '2022-11-02', '12:00', 15, 'zoom'),
(5, 'event5', '2022-11-04', '10:00', 60, 'office'),
(6, 'event6', '2022-11-04', '11:00', 120, 'zoom'),
(7, 'event7', '2022-11-04', '14:30', 10, 'hybrid'),
(8, 'event8', '2022-11-04', '14:00', 120, 'office'),
(9, 'event9', '2022-11-04', '16:30', 60, 'hybrid'),
(10, 'event10', '2022-11-04', '17:30', 15, 'hybrid'),
(11, 'event11', '2022-11-05', '8:10', 240, 'zoom'),
(12, 'event12', '2022-11-05', '9:30', 300, 'hybrid'),
(13, 'event13', '2022-11-05', '14:45', 315, 'hybrid'),
(14, 'event14', '2022-11-06', '8:00', 600, 'office');




insert into schedule values 
(1,1),
(2,1),
(4,1),
(2,4),
(1,4),
(3,3),
(1,3),
(11,1),
(5,1),
(6,1),
(8,2),
(12,2),
(13,1),
(11,3),
(14,1),
(14,3),
(7,1);



